lib/tasks/db_seed.rake

INSERT INTO "movies" ("title", "year", "details", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  task seed_movies: :environment do
    abort("This task is not meant to be run outside of development") unless Rails.env.development?

    api_key = 'fbb9e47c'
    url = "http://www.omdbapi.com/?apikey=#{api_key}&s=Movie&type=movie&page="

    puts "Fetching three pages of movies from OMDb, this may take a moment..."
    (1..3).each do |page|
      response = HTTParty.get("#{url}#{page}")

      if response.code == 200
        results = response.parsed_response["Search"]

        results.each do |result|
          movie_id = result["imdbID"]
          movie_response = HTTParty.get("http://www.omdbapi.com/?apikey=#{api_key}&i=#{movie_id}")

          if movie_response.code == 200
            movie = movie_response.parsed_response

            Movie.create!(
              title: movie["Title"],
              year: movie["Year"].to_i,
              details: movie["Plot"]
            )