app/views/movies/show.html.erb


  <% if current_user&.favorite_movies&.include?(@movie) %>
---
SELECT 1 AS one FROM "movies" INNER JOIN "favorites" ON "movies"."id" = "favorites"."movie_id" WHERE "favorites"."user_id" = $1 AND "movies"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]