app/controllers/application_controller.rb

  def current_user
    @current_user ||= User.find_by(id: session[:user_id]) if session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def authenticate_api_request
    token = request.headers['Authorization']
    @current_user = User.find_by(authentication_token: token)
---
SELECT "users".* FROM "users" WHERE "users"."authentication_token" = $1 LIMIT $2  [["authentication_token", "[FILTERED]"], ["LIMIT", 1]]