app/controllers/favorites_controller.rb

  def create
    movie = Movie.find(params[:movie_id])
    favorite = current_user.favorites.build(movie: movie)

    respond_to do |format|
      format.html do
        unless favorite.save
          flash[:error] = "Unable to add movie to favorites."
        end

        redirect_to movie_path(movie)
      end
      format.json do
        if favorite.save
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "authentication_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "test@test.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-04-07 04:52:20.340104"], ["updated_at", "2023-04-07 04:52:20.340104"], ["authentication_token", "[FILTERED]"]]
INSERT INTO "favorites" ("user_id", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["movie_id", 8], ["created_at", "2023-04-06 13:42:06.621080"], ["updated_at", "2023-04-06 13:42:06.621080"]]
INSERT INTO "favorites" ("user_id", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["movie_id", 15], ["created_at", "2023-04-06 13:16:34.223305"], ["updated_at", "2023-04-06 13:16:34.223305"]]

  def destroy
    current_user.favorites.find_by(movie_id: params[:id]).destroy
---
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 29]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."movie_id" = $2 LIMIT $3  [["user_id", 5], ["movie_id", 15], ["LIMIT", 1]]

  def toggle
    favorite = current_user.favorites.find_by(movie_id: params[:movie_id])

    if favorite
      favorite.destroy
    else
      current_user.favorites.create(movie_id: params[:movie_id])
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."movie_id" = $2 LIMIT $3  [["user_id", 5], ["movie_id", 5], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 47]]
INSERT INTO "favorites" ("user_id", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["movie_id", 5], ["created_at", "2023-04-07 01:39:16.682371"], ["updated_at", "2023-04-07 01:39:16.682371"]]