app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (title ILIKE '%Scary%')
SELECT "movies".* FROM "movies"
---
  def index
    if params[:search].present?
      @movies = Movie.search(params[:search]).records
    else
      @movies = Movie.all

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @movie = Movie.find(params[:id])