app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "authentication_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "test4@test.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-04-06 12:07:39.472239"], ["updated_at", "2023-04-06 12:07:39.472239"], ["authentication_token", "[FILTERED]"]]
---
  def create
    @user = User.new(user_params)

    if @user.save