app/models/user.rb

SELECT 1 AS one FROM "users" WHERE "users"."authentication_token" = $1 LIMIT $2  [["authentication_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def generate_authentication_token
    # Ensure that the token is truly unique, even if the chance of a duplicate
    # is very small
    loop do
      self.authentication_token = SecureRandom.hex(20)
      break unless User.exists?(authentication_token: authentication_token)